#!/bin/bash

strings=(
    "░P░i░n░k░ ░V░o░i░d░"
    "【P】【i】【n】【k】 【V】【o】【i】【d】"
    "『P』『i』『n』『k』 『V』『o』『i』『d』"
    "≋P≋i≋n≋k≋ ≋V≋o≋i≋d≋"
    "(っ◔◡◔)っ ♥ Pink Void ♥"
    "Ｐｉｎｋ░Ｖｏｉｄ　（ヘふワ）"
    "Ｐｉｎｋ　Ｖｏｉｄ　ヘふワ"
    '˜”*°•.˜”*°• Pink Void •°*”˜.•°*”˜'
    "【﻿Ｐｉｎｋ　Ｖｏｉｄ】"
    "P҉i҉n҉k҉ ҉V҉o҉i҉d҉"
    "[̲̅P][̲̅i][̲̅n][̲̅k] [̲̅V][̲̅o][̲̅i][̲̅d]"
    "P҉i҉n҉k҉ ҉V҉o҉i҉d҉"
    "ᑭIᑎK ᐯOIᗪ"
    "ᕵᓰᘉᖽᐸ ᐺᓍᓰᕲ"
    "P̶i̶n̶k̶ ̶V̶o̶i̶d̶"
    "P̴i̴n̴k̴ ̴V̴o̴i̴d̴"
    "P̷i̷n̷k̷ ̷V̷o̷i̷d̷"
    "P̲i̲n̲k̲ ̲V̲o̲i̲d̲"
    "P̳i̳n̳k̳ ̳V̳o̳i̳d̳"
    "P̾i̾n̾k̾ ̾V̾o̾i̾d̾"
    "P♥i♥n♥k♥ ♥V♥o♥i♥d"
    "P͎i͎n͎k͎ ͎V͎o͎i͎d͎"
    "P͓̽i͓̽n͓̽k͓̽ ͓̽V͓̽o͓̽i͓̽d͓̽"
    "𝙋𝙞𝙣𝙠 𝙑𝙤𝙞𝙙"
    "𝐏𝐢𝐧𝐤 𝐕𝐨𝐢𝐝"
    "𝗣𝗶𝗻𝗸 𝗩𝗼𝗶𝗱"
    "𝘗𝘪𝘯𝘬 𝘝𝘰𝘪𝘥"
)

alhapbets=(
"𝔞 𝔟 𝔠 𝔡 𝔢 𝔣 𝔤 𝔥 𝔦 𝔧 𝔨 𝔩 𝔪 𝔫 𝔬 𝔭 𝔮 𝔯 𝔰 𝔱 𝔲 𝔳 𝔴 𝔵 𝔶 𝔷"
"𝖆 𝖇 𝖈 𝖉 𝖊 𝖋 𝖌 𝖍 𝖎 𝖏 𝖐 𝖑 𝖒 𝖓 𝖔 𝖕 𝖖 𝖗 𝖘 𝖙 𝖚 𝖛 𝖜 𝖝 𝖞 𝖟"
"𝓪 𝓫 𝓬 𝓭 𝓮 𝓯 𝓰 𝓱 𝓲 𝓳 𝓴 𝓵 𝓶 𝓷 𝓸 𝓹 𝓺 𝓻 𝓼 𝓽 𝓾 𝓿 𝔀 𝔁 𝔂 𝔃"
"𝒶 𝒷 𝒸 𝒹 𝑒 𝒻 𝑔 𝒽 𝒾 𝒿 𝓀 𝓁 𝓂 𝓃 𝑜 𝓅 𝓆 𝓇 𝓈 𝓉 𝓊 𝓋 𝓌 𝓍 𝓎 𝓏"
"𝕒 𝕓 𝕔 𝕕 𝕖 𝕗 𝕘 𝕙 𝕚 𝕛 𝕜 𝕝 𝕞 𝕟 𝕠 𝕡 𝕢 𝕣 𝕤 𝕥 𝕦 𝕧 𝕨 𝕩 𝕪 𝕫"
"ａ ｂ ｃ ｄ ｅ ｆ ｇ ｈ ｉ ｊ ｋ ｌ ｍ ｎ ｏ ｐ ｑ ｒ ｓ ｔ ｕ ｖ ｗ ｘ ｙ ｚ"
"ꪖ ᥇ ᥴ ᦔ ꫀ ᠻ ᧁ ꫝ ꠸ ꠹ ᛕ ꪶ ꪑ ꪀ ꪮ ρ ꪇ ᥅ ᦓ ꪻ ꪊ ꪜ ᭙ ᥊ ꪗ ƺ"
"𝒶 𝒷 𝒸 𝒹 𝑒 𝒻 𝑔 𝒽 𝒾 𝒿 𝓀 𝓁 𝓂 𝓃 𝓅 𝓆 𝓇 𝓈 𝓉 𝓊 𝓋 𝓌 𝓍 𝓎 𝓏"
"ᴀ ʙ ᴄ ᴅ ᴇ ꜰ ɢ ʜ ɪ ᴊ ᴋ ʟ ᴍ ɴ ᴏ ᴘ Q ʀ ꜱ ᴛ ᴜ ᴠ ᴡ x ʏ ᴢ"
"z ʎ x ʍ ʌ n ʇ s ɹ b d o u ɯ l ʞ ɾ ı ɥ ɓ ɟ ǝ p ɔ q ɐ"
"🄰 🄱 🄲 🄳 🄴 🄵 🄶 🄷 🄸 🄹 🄺 🄻 🄼 🄽 🄾 🄿 🅀 🅁 🅂 🅃 🅄 🅅 🅆 🅇 🅈 🅉"
"ƹ ʏ x w v u ƚ ꙅ ɿ p q o ᴎ m | ʞ ꞁ i ʜ ǫ Ꮈ ɘ b ɔ d ɒ"
"à̶̱̦̠̠ͅ ̴̠̖̈̏͠ḇ̵̨̲͓̖̣̂̊̊͘ ̸͙͎̗͈̾͊͒̾̔͛̈́̍̓͝c̸̣̼͎̫͓̥̲͉͓̈̓͛̏͐͝ ̵̢̮͓̮͛̈́̉́̒͜͠ḋ̸̛͓̗͎͎̭͖͆̔̓̍̔̕̚͜͜ ̸̜̦̪̞͎̪̪͈̉̈́̌e̶̮͖̜̘̹̺̰̻̔̄̓̾̓͘͘ ̸͕̥̗̙̲̭̫̯̮̍̂͗͋̆̃f̷̭̞̯͉̻̞̼͍̅̇̒ ̵̩͆ǵ̴̤̪̯̦̣̭̞̦͋ ̴̠̣͖̠̋͛͗̆̿͝ḣ̶̨̥̺̠̬̻̖ ̸͕̮̫̤̇̾͝͝ȉ̴͖̤͐͂̿̀͠ ̷͓͍̽͛̄̐́j̷͔̀ ̵͚̖̟̱̈̄̄̒̾̔̅̾̚͝ḵ̶͙̃̒͌̽̂͗̀͆͝͠ ̸̡͈̻̗̫̘̰̣̱͔̐̾͂ļ̸̟͔͉͎̬͔͙̥̒̊̓̌͜ ̶̡̟̱̎͗̆͗͆͌͐́͘m̷̡̯̩̮̿̉ ̵̢̢̦͚̻͖̯̿̾̎̉̒͗̆n̷̳̠̺̜͙̎̈́͋̈́ ̴̳͙̪̏̍͘ơ̴̫̗͆̂̓̿ ̴͚̼̪͍̖̿̓̈́͒̓͘̕͝ṕ̶̨̡̛̙̄́̚ ̶̨̤̝̪̥͇̦̰̞̀́̃̿͊̋̒q̸̢̛̲̠̼͔͉̙̘̇̋̏͐̾̂͆̓̀ ̵̡̅͐̕ṛ̶̛͖͊̽̿͐̾̓̄̕ͅ ̶̡̰͇̤̲̫͓͇̩̐ṣ̴̡̛̥͎̠̘̲̯̜̯̌̒̃̀͑ ̸̧͎̳͉͙̜̺̿̿̚͜͝t̵̢͉̯̙̰̮̭͈̱͐̈́̃̈́̉̌ͅ ̴͚̆̈̂͑͋̈́̒̈́̇̚ù̴̩̬͈̩̗̘̓̽́͑̅͌̀͘ ̴͍͋̈́v̵̩͇̱͈̜͓̞͎̤̒̓͌͑͜ ̴̨͉͕̼̒͆̿̋̃̐̏̉͂w̷̨̢̫̱͌͛̀ͅ ̵̢̢̯̱̳̓̍̅̓̇̕x̸̛̪̊̐̈̚ ̵̧̗̦͔̺̦͈̖̾̇́̂͆͊̏̕͝y̸̥̗͚̔̿̂́̅̄̃ ̸̛̙̬͓͓̜̯̔̓̀̈z̷̧̩͎̃͗͆̕ͅ"
"🅰 🅱 🅲 🅳 🅴 🅵 🅶 🅷 🅸 🅹 🅺 🅻 🅼 🅽 🅾 🅿 🆀 🆁 🆂 🆃 🆄 🆅 🆆 🆇 🆈 🆉"
"ₐ b c d ₑ f g ₕ ᵢ ⱼ ₖ ₗ ₘ ₙ ₒ ₚ q ᵣ ₛ ₜ ᵤ ᵥ w ₓ y z"
"ᵃ ᵇ ᶜ ᵈ ᵉ ᶠ ᵍ ʰ ⁱ ʲ ᵏ ˡ ᵐ ⁿ ᵒ ᵖ q ʳ ˢ ᵗ ᵘ ᵛ ʷ ˣ ʸ ᶻ"
"ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ"
"ค ๒ ς ๔ є Ŧ ﻮ ђ เ ן к ɭ ๓ ภ ๏ ק ợ г ร Շ ย ש ฬ א ץ չ"
"α Ⴆ ƈ ԃ ҽ ϝ ɠ ԋ ι ʝ ƙ ʅ ɱ ɳ σ ρ ϙ ɾ ʂ ƚ υ ʋ ɯ x ყ ȥ"
"ǟ ɮ ƈ ɖ ɛ ʄ ɢ ɦ ɨ ʝ ӄ ʟ ʍ ռ օ ք զ ʀ ֆ ȶ ʊ ʋ ա Ӽ ʏ ʐ"
"Ꮧ Ᏸ ፈ Ꮄ Ꮛ Ꭶ Ꮆ Ꮒ Ꭵ Ꮰ Ꮶ Ꮭ Ꮇ Ꮑ Ꭷ Ꭾ Ꭴ Ꮢ Ꮥ Ꮦ Ꮼ Ꮙ Ꮗ ጀ Ꭹ ፚ"
"ą ც ƈ ɖ ɛ ʄ ɠ ɧ ı ʝ ƙ Ɩ ɱ ŋ ơ ℘ զ ཞ ʂ ɬ ų ۷ ῳ ҳ ყ ʑ"
"ค ๖ ¢ ໓ ē f ງ h i ว k l ๓ ຖ ໐ p ๑ r Ş t น ง ຟ x ฯ ຊ"
"𝐚 𝐛 𝐜 𝐝 𝐞 𝐟 𝐠 𝐡 𝐢 𝐣 𝐤 𝐥 𝐦 𝐧 𝐨 𝐩 𝐪 𝐫 𝐬 𝐭 𝐮 𝐯 𝐰 𝐱 𝐲 𝐳"
"𝗮 𝗯 𝗰 𝗱 𝗲 𝗳 𝗴 𝗵 𝗶 𝗷 𝗸 𝗹 𝗺 𝗻 𝗼 𝗽 𝗾 𝗿 𝘀 𝘁 𝘂 𝘃 𝘄 𝘅 𝘆 𝘇"
"𝘢 𝘣 𝘤 𝘥 𝘦 𝘧 𝘨 𝘩 𝘪 𝘫 𝘬 𝘭 𝘮 𝘯 𝘰 𝘱 𝘲 𝘳 𝘴 𝘵 𝘶 𝘷 𝘸 𝘹 𝘺 𝘻"
"𝙖 𝙗 𝙘 𝙙 𝙚 𝙛 𝙜 𝙝 𝙞 𝙟 𝙠 𝙡 𝙢 𝙣 𝙤 𝙥 𝙦 𝙧 𝙨 𝙩 𝙪 𝙫 𝙬 𝙭 𝙮 𝙯"
"𝚊 𝚋 𝚌 𝚍 𝚎 𝚏 𝚐 𝚑 𝚒 𝚓 𝚔 𝚕 𝚖 𝚗 𝚘 𝚙 𝚚 𝚛 𝚜 𝚝 𝚞 𝚟 𝚠 𝚡 𝚢 𝚣"
"Λ B ᄃ D Σ F G Ή I J K ᄂ M П Ө P Q Я Ƨ Ƭ Ц V Щ X Y Z"
"α в ¢ ∂ є ƒ g н ι נ к ℓ м η σ ρ q я ѕ т υ ν ω χ у z"
"å ß ¢ Ð ê £ g h ï j k l m ñ ð þ q r § † µ v w x ¥ z"
"₳ ฿ ₵ Đ Ɇ ₣ ₲ Ⱨ ł J ₭ Ⱡ ₥ ₦ Ø ₱ Q Ɽ ₴ ₮ Ʉ V ₩ Ӿ Ɏ Ⱬ"
"卂 乃 匚 ᗪ 乇 千 Ꮆ 卄 丨 ﾌ Ҝ ㄥ 爪 几 ㄖ 卩 Ɋ 尺 丂 ㄒ ㄩ ᐯ 山 乂 ㄚ 乙"
"ﾑ 乃 ᄃ り 乇 ｷ ム ん ﾉ ﾌ ズ ﾚ ﾶ 刀 の ｱ ゐ 尺 丂 ｲ ひ √ W ﾒ ﾘ 乙"
"【a】 【b】 【c】 【d】 【e】 【f】 【g】 【h】 【i】 【j】 【k】 【l】 【m】 【n】 【o】 【p】 【q】 【r】 【s】 【t】 【u】 【v】 【w】 【x】 【y】 【z】"
"『a』 『b』 『c』 『d』 『e』 『f』 『g』 『h』 『i』 『j』 『k』 『l』 『m』 『n』 『o』 『p』 『q』 『r』 『s』 『t』 『u』 『v』 『w』 『x』 『y』 『z』"
"≋a≋ ≋b≋ ≋c≋ ≋d≋ ≋e≋ ≋f≋ ≋g≋ ≋h≋ ≋i≋ ≋j≋ ≋k≋ ≋l≋ ≋m≋ ≋n≋ ≋o≋ ≋p≋ ≋q≋ ≋r≋ ≋s≋ ≋t≋ ≋u≋ ≋v≋ ≋w≋ ≋x≋ ≋y≋ ≋z≋"
"░a░ ░b░ ░c░ ░d░ ░e░ ░f░ ░g░ ░h░ ░i░ ░j░ ░k░ ░l░ ░m░ ░n░ ░o░ ░p░ ░q░ ░r░ ░s░ ░t░ ░u░ ░v░ ░w░ ░x░ ░y░ ░z░"
"(っ◔◡◔)っ ♥ a b c d e f g h i j k l m n o p q r s t u v w x y z ♥"
"ａ　ｂ　ｃ　ｄ　ｅ　ｆ　ｇ　ｈ　ｉ　ｊ　ｋ　ｌ　ｍ　ｎ　ｏ　ｐ　ｑ　ｒ　ｓ　ｔ　ｕ　ｖ　ｗ　ｘ　ｙ　ｚ　虞ヵ音げソのメゥ　や威　宛かク姻竹ギヮの媛く偉　が無゠ヽ　哀"
"ａ░ｂ░ｃ░ｄ░ｅ░ｆ░ｇ░ｈ░ｉ░ｊ░ｋ░ｌ░ｍ░ｎ░ｏ░ｐ░ｑ░ｒ░ｓ░ｔ░ｕ░ｖ░ｗ░ｘ░ｙ░ｚ　（虞ヵ音げソのメゥ　や威　宛かク姻竹ギヮの媛く偉　が無゠ヽ　哀）"
"【﻿ａ　ｂ　ｃ　ｄ　ｅ　ｆ　ｇ　ｈ　ｉ　ｊ　ｋ　ｌ　ｍ　ｎ　ｏ　ｐ　ｑ　ｒ　ｓ　ｔ　ｕ　ｖ　ｗ　ｘ　ｙ　ｚ】"
"[̲̅a] [̲̅b] [̲̅c] [̲̅d] [̲̅e] [̲̅f] [̲̅g] [̲̅h] [̲̅i] [̲̅j] [̲̅k] [̲̅l] [̲̅m] [̲̅n] [̲̅o] [̲̅p] [̲̅q] [̲̅r] [̲̅s] [̲̅t] [̲̅u] [̲̅v] [̲̅w] [̲̅x] [̲̅y] [̲̅z]"
"a҉ ҉b҉ ҉c҉ ҉d҉ ҉e҉ ҉f҉ ҉g҉ ҉h҉ ҉i҉ ҉j҉ ҉k҉ ҉l҉ ҉m҉ ҉n҉ ҉o҉ ҉p҉ ҉q҉ ҉r҉ ҉s҉ ҉t҉ ҉u҉ ҉v҉ ҉w҉ ҉x҉ ҉y҉ ҉z҉"
"ą ҍ ç ժ ҽ ƒ ց հ ì ʝ ҟ Ӏ ʍ ղ օ ք զ ɾ ʂ է մ ѵ ա × վ Հ"
"ᗩ ᗷ ᑕ ᗪ E ᖴ G ᕼ I ᒍ K ᒪ ᗰ ᑎ O ᑭ ᑫ ᖇ ᔕ T ᑌ ᐯ ᗯ ᙭ Y ᘔ"
"ᗩ ᗷ ᑢ ᕲ ᘿ ᖴ ᘜ ᕼ ᓰ ᒚ ᖽᐸ ᒪ ᘻ ᘉ ᓍ ᕵ ᕴ ᖇ S ᖶ ᑘ ᐺ ᘺ ᙭ ᖻ ᗱ"
"a̶ ̶b̶ ̶c̶ ̶d̶ ̶e̶ ̶f̶ ̶g̶ ̶h̶ ̶i̶ ̶j̶ ̶k̶ ̶l̶ ̶m̶ ̶n̶ ̶o̶ ̶p̶ ̶q̶ ̶r̶ ̶s̶ ̶t̶ ̶u̶ ̶v̶ ̶w̶ ̶x̶ ̶y̶ ̶z̶"
"a̴ ̴b̴ ̴c̴ ̴d̴ ̴e̴ ̴f̴ ̴g̴ ̴h̴ ̴i̴ ̴j̴ ̴k̴ ̴l̴ ̴m̴ ̴n̴ ̴o̴ ̴p̴ ̴q̴ ̴r̴ ̴s̴ ̴t̴ ̴u̴ ̴v̴ ̴w̴ ̴x̴ ̴y̴ ̴z̴"
"a̷ ̷b̷ ̷c̷ ̷d̷ ̷e̷ ̷f̷ ̷g̷ ̷h̷ ̷i̷ ̷j̷ ̷k̷ ̷l̷ ̷m̷ ̷n̷ ̷o̷ ̷p̷ ̷q̷ ̷r̷ ̷s̷ ̷t̷ ̷u̷ ̷v̷ ̷w̷ ̷x̷ ̷y̷ ̷z̷"
"a̲ ̲b̲ ̲c̲ ̲d̲ ̲e̲ ̲f̲ ̲g̲ ̲h̲ ̲i̲ ̲j̲ ̲k̲ ̲l̲ ̲m̲ ̲n̲ ̲o̲ ̲p̲ ̲q̲ ̲r̲ ̲s̲ ̲t̲ ̲u̲ ̲v̲ ̲w̲ ̲x̲ ̲y̲ ̲z̲"
"a̳ ̳b̳ ̳c̳ ̳d̳ ̳e̳ ̳f̳ ̳g̳ ̳h̳ ̳i̳ ̳j̳ ̳k̳ ̳l̳ ̳m̳ ̳n̳ ̳o̳ ̳p̳ ̳q̳ ̳r̳ ̳s̳ ̳t̳ ̳u̳ ̳v̳ ̳w̳ ̳x̳ ̳y̳ ̳z̳"
"a̾ ̾b̾ ̾c̾ ̾d̾ ̾e̾ ̾f̾ ̾g̾ ̾h̾ ̾i̾ ̾j̾ ̾k̾ ̾l̾ ̾m̾ ̾n̾ ̾o̾ ̾p̾ ̾q̾ ̾r̾ ̾s̾ ̾t̾ ̾u̾ ̾v̾ ̾w̾ ̾x̾ ̾y̾ ̾z̾"
"a♥ ♥b♥ ♥c♥ ♥d♥ ♥e♥ ♥f♥ ♥g♥ ♥h♥ ♥i♥ ♥j♥ ♥k♥ ♥l♥ ♥m♥ ♥n♥ ♥o♥ ♥p♥ ♥q♥ ♥r♥ ♥s♥ ♥t♥ ♥u♥ ♥v♥ ♥w♥ ♥x♥ ♥y♥ ♥z"
"a͎ ͎b͎ ͎c͎ ͎d͎ ͎e͎ ͎f͎ ͎g͎ ͎h͎ ͎i͎ ͎j͎ ͎k͎ ͎l͎ ͎m͎ ͎n͎ ͎o͎ ͎p͎ ͎q͎ ͎r͎ ͎s͎ ͎t͎ ͎u͎ ͎v͎ ͎w͎ ͎x͎ ͎y͎ ͎z͎"
"a͓̽ ͓̽b͓̽ ͓̽c͓̽ ͓̽d͓̽ ͓̽e͓̽ ͓̽f͓̽ ͓̽g͓̽ ͓̽h͓̽ ͓̽i͓̽ ͓̽j͓̽ ͓̽k͓̽ ͓̽l͓̽ ͓̽m͓̽ ͓̽n͓̽ ͓̽o͓̽ ͓̽p͓̽ ͓̽q͓̽ ͓̽r͓̽ ͓̽s͓̽ ͓̽t͓̽ ͓̽u͓̽ ͓̽v͓̽ ͓̽w͓̽ ͓̽x͓̽ ͓̽y͓̽ ͓̽z͓̽"
"𝒶 𝒷 𝒸 𝒹 𝑒 𝒻 𝑔 𝒽 𝒾 𝒿 𝓀 𝓁 𝓂 𝓃 𝓅 𝓆 𝓇 𝓈 𝓉 𝓊 𝓋 𝓌 𝓍 𝓎 𝓏"
)

gothicka=(
    "𝔞"
    "𝔟"
    "𝔠"
    "𝔡"
    "𝔢"
    "𝔣"
    "𝔤"
    "𝔥"
    "𝔦"
    "𝔧"
    "𝔨"
    "𝔩"
    "𝔪"
    "𝔫"
    "𝔬"
    "𝔭"
    "𝔮"
    "𝔯"
    "𝔰"
    "𝔱"
    "𝔲"
    "𝔳"
    "𝔴"
    "𝔵"
    "𝔶"
    "𝔷"
)

tput clear

while true; do
    read -rsN1 key
    case "${key}" in
        a) printf "%s" "${gothicka[0]}" ;;
        b) printf "%s" "${gothicka[1]}" ;;
        c) printf "%s" "${gothicka[2]}" ;;
        d) printf "%s" "${gothicka[3]}" ;;
        e) printf "%s" "${gothicka[4]}" ;;
        f) printf "%s" "${gothicka[5]}" ;;
        g) printf "%s" "${gothicka[6]}" ;;
        h) printf "%s" "${gothicka[7]}" ;;
        i) printf "%s" "${gothicka[8]}" ;;
        j) printf "%s" "${gothicka[9]}" ;;
        k) printf "%s" "${gothicka[10]}" ;;
        l) printf "%s" "${gothicka[11]}" ;;
        m) printf "%s" "${gothicka[12]}" ;;
        n) printf "%s" "${gothicka[13]}" ;;
        o) printf "%s" "${gothicka[14]}" ;;
        p) printf "%s" "${gothicka[15]}" ;;
        q) printf "%s" "${gothicka[16]}" ;;
        r) printf "%s" "${gothicka[17]}" ;;
        s) printf "%s" "${gothicka[18]}" ;;
        t) printf "%s" "${gothicka[19]}" ;;
        u) printf "%s" "${gothicka[20]}" ;;
        v) printf "%s" "${gothicka[21]}" ;;
        w) printf "%s" "${gothicka[22]}" ;;
        x) printf "%s" "${gothicka[23]}" ;;
        y) printf "%s" "${gothicka[24]}" ;;
        z) printf "%s" "${gothicka[25]}" ;;
        ' ') printf "%s" " " ;;
        $'\x0a') printf "%s\n" "" ;;
    esac
done
